perf/quotes/quotes_peak.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
      phases:
        - name: Warm up
          duration: 120
          arrivalCount: 60
        - name: Plain
          duration: 60
          arrivalCount: 90
        - name: Plain
          duration: 60
          arrivalCount: 120
        - name: Plain
          duration: 60
          arrivalCount: 150
        - name: Ramp
          arrivalRate: 2.5
          rampTo: 5
          duration: 180
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections
    

scenarios:
  - name: peak
    flow:
      - get:
          url: '/quotes'